** notes on python
numpy really likes broadcasting.

numbers are expanded to vectors if you try to add/sub/mul/div them with
vectors/matrices, then the opration is done element-wise.

vectors are expanded if you try to add/sub/mul/div by copying rows/columns until
the sizes of the vectors fit (only if one dimension is 1), and then do the
operation element-wise.

see [[https://docs.scipy.org/doc/numpy/user/basics.broadcasting.html][the numpy docs]] for more information.

#+begin_src python :session week2py :results silent
import numpy as np
#+end_src

#+begin_src python :session week2py :results output :exports both
a = np.array([[1,2,3,4], [5, 6, 7, 8]])
print("a:\n" + str(a))
print("a*5:\n" + str(a*5))

b = np.array([[3],[5]])
print("b:\n" + str(b))
print("b+a:\n" + str(b+a))
print("a+b:\n" + str(a+b))
#+end_src

#+RESULTS:
#+begin_example
a:
[[1 2 3 4]
 [5 6 7 8]]
a*5:
[[ 5 10 15 20]
 [25 30 35 40]]
b:
[[3]
 [5]]
b+a:
[[ 4  5  6  7]
 [10 11 12 13]]
a+b:
[[ 4  5  6  7]
 [10 11 12 13]]
#+end_example

